{
  "master_checklist": [
    {
      "id": 1,
      "rule": "Every page must have a visual element (DALL-E image, infographic, data viz, or artistic graphic)",
      "source": "v1 feedback",
      "category": "visuals"
    },
    {
      "id": 2,
      "rule": "Layout must be balanced — never too empty, never too crowded. Like a luxury fashion brand website (Hermes, Chanel, LV)",
      "source": "v1 feedback",
      "category": "layout"
    },
    {
      "id": 3,
      "rule": "Design algorithm must produce a COMPLETELY DIFFERENT design every single time. Never repeat palette, layout, or motifs",
      "source": "v1 feedback",
      "category": "design"
    },
    {
      "id": 4,
      "rule": "Use ALL tools creatively: DALL-E for images, Pillow for infographics, matplotlib for data viz. Be creative, unique, different every time, but still classy",
      "source": "v1 feedback",
      "category": "visuals"
    },
    {
      "id": 5,
      "rule": "Author is ALWAYS 'Bhasker Kumar' — never fictional names",
      "source": "v1 feedback",
      "category": "author"
    },
    {
      "id": 6,
      "rule": "Assisted by rotating luxury-brand-style name (like Jaguar Phantom). Flavor of high-end luxury goods: perfume, wallet, leather, jewelry brands",
      "source": "v1 feedback",
      "category": "author"
    },
    {
      "id": 7,
      "rule": "Mention it is an agentic system made of multiple agents using Claude, Gemini, and ChatGPT",
      "source": "v1 feedback",
      "category": "author"
    },
    {
      "id": 8,
      "rule": "Build proper orchestration of agents who TALK to each other, CRITICIZE each other. Not a linear system.",
      "source": "v1 feedback",
      "category": "architecture"
    },
    {
      "id": 9,
      "rule": "The design should behave like a top luxury product website designer",
      "source": "v1 feedback",
      "category": "design"
    },
    {
      "id": 10,
      "rule": "The messaging should read like it was written by a top advertisement script designer — make news palatable as luxury advertisement",
      "source": "v1 feedback",
      "category": "content"
    },
    {
      "id": 11,
      "rule": "No empty space on bottom of pages — pages must not look dull",
      "source": "v2 feedback",
      "category": "layout"
    },
    {
      "id": 12,
      "rule": "Author and assistant name must be PROMINENT — visible, not small hidden text",
      "source": "v2 feedback",
      "category": "author"
    },
    {
      "id": 13,
      "rule": "ScreenRealEstateAgent must review the PDF after creation and ensure proper fill",
      "source": "v2 feedback",
      "category": "architecture"
    },
    {
      "id": 14,
      "rule": "Use design psychology: golden ratio (1.618) for proportions",
      "source": "v2 feedback",
      "category": "design_psychology"
    },
    {
      "id": 15,
      "rule": "Use color psychology for mood (deep blue=trust, gold=luxury, dark gray=authority)",
      "source": "v2 feedback",
      "category": "design_psychology"
    },
    {
      "id": 16,
      "rule": "Typography hierarchy: at least 3 levels (display, body, caption)",
      "source": "v2 feedback",
      "category": "design_psychology"
    },
    {
      "id": 17,
      "rule": "Every agent must have TWO roles: a PREPARER and a REVIEWER that argue back and forth",
      "source": "v2 feedback",
      "category": "architecture"
    },
    {
      "id": 18,
      "rule": "Solve this narrow problem with heart and soul — become the BEST in this class, not just automation",
      "source": "v2 feedback",
      "category": "meta"
    },
    {
      "id": 19,
      "rule": "PDF should look like PRESENTATION SLIDES (PPT style), not a text document",
      "source": "v3 feedback",
      "category": "format"
    },
    {
      "id": 20,
      "rule": "Big headers on every page — commanding, presentation-style",
      "source": "v3 feedback",
      "category": "format"
    },
    {
      "id": 21,
      "rule": "Use bullet points, NOT paragraphs. Short punchy bullets. Only a few pages may have slightly more text.",
      "source": "v3 feedback",
      "category": "format"
    },
    {
      "id": 22,
      "rule": "Every single page must have an exciting background — not just the cover. Rich, artistic, never dull or plain.",
      "source": "v3 feedback",
      "category": "layout"
    },
    {
      "id": 23,
      "rule": "Cover page (first slide) must be SUPER exciting — the wow factor",
      "source": "v3 feedback",
      "category": "layout"
    },
    {
      "id": 24,
      "rule": "EVERY page background must have a very light artistic drawing/pattern as canvas — subtle enough to not dominate the content but present enough to never look plain or dull",
      "source": "v4 feedback",
      "category": "layout"
    },
    {
      "id": 25,
      "rule": "Author 'Bhasker Kumar' and assistant name must DOMINATE the first slide. Must not be smaller than 75% of the header font size.",
      "source": "v4 feedback",
      "category": "author"
    },
    {
      "id": 26,
      "rule": "Build a FinalValidatorAgent that checks ALL these checkpoints. Score each. Only publish if overall score > 80%. Otherwise take feedback and recreate.",
      "source": "v4 feedback",
      "category": "architecture"
    },
    {
      "id": 27,
      "rule": "Guardrail at THREE layers (Director, Final Reviewer, Content Writer): 'Speak the truth, but never a truth that will hurt someone in thought, action, and speech'",
      "source": "v4 feedback",
      "category": "guardrails"
    },
    {
      "id": 28,
      "rule": "Do NOT bypass or shortcut instructions. Implement EXACTLY as specified. Every rule at every place it's specified.",
      "source": "v4 feedback",
      "category": "meta"
    },
    {
      "id": 29,
      "rule": "Content must always be neutral — never negative or abusive about individuals. May be constructively critical of ideas/approaches.",
      "source": "v1 feedback",
      "category": "guardrails"
    },
    {
      "id": 30,
      "rule": "Each page should have ONE clear idea — one piece of information, a quote, short text, and a visual",
      "source": "v1 feedback",
      "category": "format"
    },
    {
      "id": 31,
      "rule": "Keep detailed log of ALL user feedback for fine-tuning and continuous improvement",
      "source": "v2 feedback",
      "category": "meta"
    },
    {
      "id": 32,
      "rule": "Keep detailed log of all LinkedIn posts (post ID, URL, topic, date, PDF) to never repeat content",
      "source": "v2 feedback",
      "category": "meta"
    },
    {
      "id": 33,
      "rule": "The AI designer agent must let imagination loose — different style every time",
      "source": "v1 feedback",
      "category": "design"
    },
    {
      "id": 34,
      "rule": "Use multiple perspectives: history, economy, sociology, future impact predictions",
      "source": "v1 feedback",
      "category": "content"
    },
    {
      "id": 35,
      "rule": "Written as if by an AI thought leader, head of consulting company or partner",
      "source": "v1 feedback",
      "category": "content"
    },
    {
      "id": 36,
      "rule": "LinkedIn expert must use proper Unicode formatting for bold/italic headers (LinkedIn does not support markdown)",
      "source": "v1 feedback",
      "category": "linkedin"
    }
  ],
  "feedback_history": [
    {
      "version": "v1",
      "date": "2026-02-10",
      "points": "No visuals, text in corners, empty pages, need agent orchestration, Bhasker Kumar author, luxury brand assistant, DALL-E/Pillow visuals, different design every time, luxury ad copy",
      "status": "addressed"
    },
    {
      "version": "v2",
      "date": "2026-02-10",
      "points": "Empty bottom of pages, small author text, need ScreenRealEstateAgent, golden ratio, color psychology, preparer/reviewer pairs, solve narrow problem with excellence",
      "status": "addressed"
    },
    {
      "version": "v3",
      "date": "2026-02-10",
      "points": "Must look like PPT slides not document, big headers, bullets not paragraphs, exciting backgrounds on ALL pages, cover super exciting",
      "status": "addressing"
    },
    {
      "version": "v4",
      "date": "2026-02-10",
      "points": "Every page needs light artistic background on canvas, author/assistant 75% of header size, FinalValidatorAgent with 30+ checkpoints scoring 80%+, guardrails at 3 layers, no shortcuts",
      "status": "addressing"
    }
  ],
  "design_rules": {
    "always": [
      "PPT slide style — big headers, bullets, visual-heavy, not a text document",
      "Every page has artistic background (light pattern/gradient/texture) — never plain/dull",
      "Cover page is SUPER exciting — hero image, dramatic, wow factor",
      "Author 'Bhasker Kumar' at >= 75% of header font size on cover",
      "Rotating luxury brand assistant name prominently displayed",
      "Agentic system credits (Claude, Gemini, ChatGPT) visible",
      "Bullet points not paragraphs on most pages",
      "One clear idea per page",
      "Visual element on every page (DALL-E, infographic, data viz)",
      "Design completely different every version",
      "Luxury aesthetic (Hermes, Chanel, LV level)",
      "Golden ratio proportions",
      "Color psychology applied",
      "3-level typography hierarchy",
      "Guardrail at 3 layers: truth but never hurtful"
    ],
    "never": [
      "Never plain/white/dull backgrounds on any page",
      "Never paragraphs of dense text (use bullets)",
      "Never small/hidden author text",
      "Never repeat design patterns",
      "Never fictional author names",
      "Never negative about individuals",
      "Never bypass or shortcut instructions"
    ]
  },
  "iteration_count": 5,
  "last_updated": "2026-02-10T22:14:20Z"
}